app/controllers/cards_controller.rb

INSERT INTO "cards" ("cardID", "setTotal", "setName", "cardName", "cardColour", "cardType", "powerTough", "castingCost", "cardText", "artist", "rarity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save

UPDATE "cards" SET "setTotal" = $1, "cardType" = $2, "cardText" = $3, "rarity" = $4, "updated_at" = $5 WHERE "cards"."id" = $6  [["setTotal", 256], ["cardType", "tttt"], ["cardText", "errererrrr"], ["rarity", "uncommon"], ["updated_at", "2017-09-30 13:40:40.548934"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 1]]
---
  def destroy
    @card.destroy

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_card
      @card = Card.find(params[:id])