app/controllers/decks_controller.rb

  def index
    @decks = Deck.all
---
SELECT "decks".* FROM "decks"

  def create
    @deck = Deck.new(deck_params)

    respond_to do |format|
      if @deck.save
---
INSERT INTO "decks" ("deckID", "dateCreated", "deckName", "deckType", "deckDescription", "totalCards", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @deck.update(deck_params)
---
UPDATE "decks" SET "dateCreated" = $1, "updated_at" = $2 WHERE "decks"."id" = $3  [["dateCreated", "2017-11-12 00:00:00.000000"], ["updated_at", "2017-11-05 08:21:32.547093"], ["id", 2]]

  def set_deck
    @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT 1  [["id", 2]]